Repository: cmwen/read-forge-app
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, hi, ja, ko, pt, ru, zh, zh_tw

source: New Book
ar: كتاب جديد
de: Neues Buch
es: Nuevo Libro
fr: Nouveau Livre
hi: नई पुस्तक
ja: 新しい本
ko: 새 책
pt: Novo Livro
ru: Новая Книга
zh: 新建图书
zh_tw: 新增圖書

source: No books yet
ar: لا توجد كتب بعد
de: Noch keine Bücher
es: Aún no hay libros
fr: Pas encore de livres
hi: अभी तक कोई पुस्तक नहीं
ja: まだ本がありません
ko: 아직 책이 없습니다
pt: Ainda não há livros
ru: Пока нет книг
zh: 暂无图书
zh_tw: 尚無圖書

# tapToCreateFirstBook
source: Tap the + button to create your first book
ar: اضغط على زر + لإنشاء كتابك الأول
de: Tippen Sie auf die + Schaltfläche, um Ihr erstes Buch zu erstellen
es: Toca el botón + para crear tu primer libro
fr: Appuyez sur le bouton + pour créer votre premier livre
hi: अपनी पहली पुस्तक बनाने के लिए + बटन पर टैप करें
ja: + ボタンをタップして最初の本を作成してください
ko: + 버튼을 눌러 첫 번째 책을 만드세요
pt: Toque no botão + para criar seu primeiro livro
ru: Нажмите кнопку +, чтобы создать вашу первую книгу
zh: 点击 + 按钮创建您的第一本书
zh_tw: 點擊 + 按鈕建立您的第一本書

source: Create New Book
ar: إنشاء كتاب جديد
de: Neues Buch Erstellen
es: Crear Nuevo Libro
fr: Créer un Nouveau Livre
hi: नई पुस्तक बनाएं
ja: 新しい本を作成
ko: 새 책 만들기
pt: Criar Novo Livro
ru: Создать Новую Книгу
zh: 创建新图书
zh_tw: 建立新圖書

# createBookInstructions
source: Fill in at least one field below. If you don't provide a title, AI can generate one for you based on your description or purpose.
ar: املأ حقلاً واحداً على الأقل أدناه. إذا لم تقدم عنواناً، يمكن للذكاء الاصطناعي إنشاء واحد لك بناءً على وصفك أو هدفك.
de: Füllen Sie mindestens ein Feld unten aus. Wenn Sie keinen Titel angeben, kann die KI einen für Sie basierend auf Ihrer Beschreibung oder Ihrem Zweck generieren.
es: Completa al menos un campo a continuación. Si no proporcionas un título, la IA puede generar uno basado en tu descripción o propósito.
fr: Remplissez au moins un champ ci-dessous. Si vous ne fournissez pas de titre, l'IA peut en générer un pour vous en fonction de votre description ou objectif.
hi: नीचे कम से कम एक फ़ील्ड भरें। यदि आप शीर्षक नहीं देते हैं, तो AI आपके विवरण या उद्देश्य के आधार पर एक शीर्षक बना सकता है।
ja: 以下の少なくとも1つのフィールドを入力してください。タイトルを指定しない場合、AIが説明または目的に基づいてタイトルを生成できます。
ko: 아래 항목 중 하나 이상을 입력하세요. 제목을 입력하지 않으면 AI가 설명이나 목적을 기반으로 제목을 생성할 수 있습니다.
pt: Preencha pelo menos um campo abaixo. Se você não fornecer um título, a IA pode gerar um para você com base em sua descrição ou objetivo.
ru: Заполните хотя бы одно поле ниже. Если вы не укажете название, ИИ может создать его для вас на основе вашего описания или цели.
zh: 至少填写一个字段。如果您不提供标题，AI 可以根据您的描述或目的为您生成一个。
zh_tw: 至少填寫一個欄位。如果您不提供標題，AI 可以根據您的描述或目的為您生成一個。

source: Book Title (Optional)
ar: عنوان الكتاب (اختياري)
de: Buchtitel (Optional)
es: Título del Libro (Opcional)
fr: Titre du Livre (Optionnel)
hi: पुस्तक का शीर्षक (वैकल्पिक)
ja: 本のタイトル（オプション）
ko: 책 제목 (선택사항)
pt: Título do Livro (Opcional)
ru: Название Книги (Необязательно)
zh: 图书标题（可选）
zh_tw: 圖書標題（選填）

# bookTitleHint
source: Enter a title or leave empty for AI generation
ar: أدخل عنواناً أو اتركه فارغاً للتوليد بالذكاء الاصطناعي
de: Geben Sie einen Titel ein oder lassen Sie es leer für KI-Generierung
es: Ingresa un título o déjalo vacío para generación por IA
fr: Entrez un titre ou laissez vide pour la génération par IA
hi: एक शीर्षक दर्ज करें या AI द्वारा बनाने के लिए खाली छोड़ दें
ja: タイトルを入力するか、AI生成のために空白のままにしてください
ko: 제목을 입력하거나 AI 생성을 위해 비워두세요
pt: Digite um título ou deixe vazio para geração por IA
ru: Введите название или оставьте пустым для генерации ИИ
zh: 输入标题或留空以使用 AI 生成
zh_tw: 輸入標題或留空以使用 AI 生成

source: Description (Optional)
ar: الوصف (اختياري)
de: Beschreibung (Optional)
es: Descripción (Opcional)
fr: Description (Optionnel)
hi: विवरण (वैकल्पिक)
ja: 説明（オプション）
ko: 설명 (선택사항)
pt: Descrição (Opcional)
ru: Описание (Необязательно)
zh: 描述（可选）
zh_tw: 描述（選填）

# descriptionHint
source: Describe what the book is about
ar: صف محتوى الكتاب
de: Beschreiben Sie, worum es in dem Buch geht
es: Describe de qué trata el libro
fr: Décrivez le contenu du livre
hi: पुस्तक के बारे में बताएं
ja: この本の内容を説明してください
ko: 책의 내용을 설명하세요
pt: Descreva sobre o que é o livro
ru: Опишите, о чём книга
zh: 描述这本书的内容
zh_tw: 描述這本書的內容

# purposeOptional
source: Purpose/Learning Goal (Optional)
ar: الغرض/الهدف التعليمي (اختياري)
de: Zweck/Lernziel (Optional)
es: Propósito/Objetivo de Aprendizaje (Opcional)
fr: Objectif/But d'Apprentissage (Optionnel)
hi: उद्देश्य/सीखने का लक्ष्य (वैकल्पिक)
ja: 目的/学習目標（オプション）
ko: 목적/학습 목표 (선택사항)
pt: Propósito/Objetivo de Aprendizagem (Opcional)
ru: Цель/Учебная Задача (Необязательно)
zh: 目的/学习目标（可选）
zh_tw: 目的/學習目標（選填）

# purposeHint
source: What do you want to learn from this book?
ar: ماذا تريد أن تتعلم من هذا الكتاب؟
de: Was möchten Sie aus diesem Buch lernen?
es: ¿Qué quieres aprender de este libro?
fr: Que voulez-vous apprendre de ce livre ?
hi: आप इस पुस्तक से क्या सीखना चाहते हैं?
ja: この本から何を学びたいですか？
ko: 이 책에서 무엇을 배우고 싶으신가요?
pt: O que você quer aprender com este livro?
ru: Что вы хотите узнать из этой книги?
zh: 您想从这本书中学到什么？
zh_tw: 您想從這本書中學到什麼？

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
zh: 取消
zh_tw: 取消

source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
hi: बनाएं
ja: 作成
ko: 만들기
pt: Criar
ru: Создать
zh: 创建
zh_tw: 建立

# fillAtLeastOneField
source: Please fill in at least one field
ar: يرجى ملء حقل واحد على الأقل
de: Bitte füllen Sie mindestens ein Feld aus
es: Por favor completa al menos un campo
fr: Veuillez remplir au moins un champ
hi: कृपया कम से कम एक फ़ील्ड भरें
ja: 少なくとも1つのフィールドを入力してください
ko: 하나 이상의 항목을 입력해 주세요
pt: Por favor, preencha pelo menos um campo
ru: Пожалуйста, заполните хотя бы одно поле
zh: 请至少填写一个字段
zh_tw: 請至少填寫一個欄位

source: Generate Title with AI?
ar: إنشاء عنوان بالذكاء الاصطناعي؟
de: Titel mit KI Generieren?
es: ¿Generar Título con IA?
fr: Générer le Titre avec l'IA ?
hi: AI से शीर्षक बनाएं?
ja: AIでタイトルを生成しますか？
ko: AI로 제목을 생성하시겠습니까?
pt: Gerar Título com IA?
ru: Создать Название с Помощью ИИ?
zh: 使用 AI 生成标题？
zh_tw: 使用 AI 生成標題？

# noTitleProvidedPrompt
source: No title was provided. Would you like to use AI to generate a title based on your {contentType}?
ar: لم يتم تقديم عنوان. هل تريد استخدام الذكاء الاصطناعي لإنشاء عنوان بناءً على {contentType} الخاص بك؟
de: Kein Titel angegeben. Möchten Sie die KI verwenden, um einen Titel basierend auf Ihrer {contentType} zu generieren?
es: No se proporcionó un título. ¿Te gustaría usar IA para generar un título basado en tu {contentType}?
fr: Aucun titre fourni. Souhaitez-vous utiliser l'IA pour générer un titre basé sur votre {contentType} ?
hi: कोई शीर्षक नहीं दिया गया। क्या आप अपने {contentType} के आधार पर शीर्षक बनाने के लिए AI का उपयोग करना चाहते हैं?
ja: タイトルが指定されていません。{contentType}に基づいてAIでタイトルを生成しますか？
ko: 제목이 제공되지 않았습니다. {contentType}을(를) 기반으로 AI로 제목을 생성하시겠습니까?
pt: Nenhum título foi fornecido. Gostaria de usar a IA para gerar um título com base em sua {contentType}?
ru: Название не было указано. Хотите использовать ИИ для создания названия на основе вашего {contentType}?
zh: 未提供标题。您想使用 AI 根据您的{contentType}生成标题吗？
zh_tw: 未提供標題。您想使用 AI 根據您的{contentType}生成標題嗎？

source: Skip
ar: تخطي
de: Überspringen
es: Omitir
fr: Ignorer
hi: छोड़ें
ja: スキップ
ko: 건너뛰기
pt: Pular
ru: Пропустить
zh: 跳过
zh_tw: 跳過

source: Generate Title
ar: إنشاء عنوان
de: Titel Generieren
es: Generar Título
fr: Générer le Titre
hi: शीर्षक बनाएं
ja: タイトルを生成
ko: 제목 생성
pt: Gerar Título
ru: Создать Название
zh: 生成标题
zh_tw: 生成標題

source: Generate Book Title
ar: إنشاء عنوان الكتاب
de: Buchtitel Generieren
es: Generar Título del Libro
fr: Générer le Titre du Livre
hi: पुस्तक का शीर्षक बनाएं
ja: 本のタイトルを生成
ko: 책 제목 생성
pt: Gerar Título do Livro
ru: Создать Название Книги
zh: 生成图书标题
zh_tw: 生成圖書標題

# sharePromptWithAI
source: Share this prompt with your AI assistant (ChatGPT, Claude, etc.) to generate a title.
ar: شارك هذا الموجه مع مساعد الذكاء الاصطناعي الخاص بك (ChatGPT أو Claude أو غيرها) لإنشاء عنوان.
de: Teilen Sie diese Eingabeaufforderung mit Ihrem KI-Assistenten (ChatGPT, Claude usw.), um einen Titel zu generieren.
es: Comparte esta indicación con tu asistente de IA (ChatGPT, Claude, etc.) para generar un título.
fr: Partagez cette invite avec votre assistant IA (ChatGPT, Claude, etc.) pour générer un titre.
hi: शीर्षक बनाने के लिए इस प्रॉम्प्ट को अपने AI सहायक (ChatGPT, Claude, आदि) के साथ साझा करें।
ja: このプロンプトをAIアシスタント（ChatGPT、Claudeなど）と共有してタイトルを生成してください。
ko: 이 프롬프트를 AI 어시스턴트(ChatGPT, Claude 등)와 공유하여 제목을 생성하세요.
pt: Compartilhe este prompt com seu assistente de IA (ChatGPT, Claude, etc.) para gerar um título.
ru: Поделитесь этим запросом с вашим ИИ-помощником (ChatGPT, Claude и т.д.) для создания названия.
zh: 将此提示分享给您的 AI 助手（ChatGPT、Claude 等）以生成标题。
zh_tw: 將此提示分享給您的 AI 助手（ChatGPT、Claude 等）以生成標題。

source: Copy
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
hi: कॉपी करें
ja: コピー
ko: 복사
pt: Copiar
ru: Копировать
zh: 复制
zh_tw: 複製

source: Paste Title
ar: لصق العنوان
de: Titel Einfügen
es: Pegar Título
fr: Coller le Titre
hi: शीर्षक पेस्ट करें
ja: タイトルを貼り付け
ko: 제목 붙여넣기
pt: Colar Título
ru: Вставить Название
zh: 粘贴标题
zh_tw: 貼上標題

source: Prompt copied to clipboard
ar: تم نسخ الموجه إلى الحافظة
de: Eingabeaufforderung in Zwischenablage kopiert
es: Indicación copiada al portapapeles
fr: Invite copiée dans le presse-papiers
hi: प्रॉम्प्ट क्लिपबोर्ड पर कॉपी किया गया
ja: プロンプトがクリップボードにコピーされました
ko: 프롬프트가 클립보드에 복사되었습니다
pt: Prompt copiado para a área de transferência
ru: Запрос скопирован в буфер обмена
zh: 提示已复制到剪贴板
zh_tw: 提示已複製到剪貼簿

# noTitleInClipboard
source: No title found in clipboard. Creating book with placeholder title.
ar: لم يتم العثور على عنوان في الحافظة. إنشاء كتاب بعنوان مؤقت.
de: Kein Titel in der Zwischenablage gefunden. Erstelle Buch mit Platzhaltertitel.
es: No se encontró título en el portapapeles. Creando libro con título provisional.
fr: Aucun titre trouvé dans le presse-papiers. Création du livre avec un titre provisoire.
hi: क्लिपबोर्ड में कोई शीर्षक नहीं मिला। प्लेसहोल्डर शीर्षक के साथ पुस्तक बना रहे हैं।
ja: クリップボードにタイトルが見つかりませんでした。プレースホルダータイトルで本を作成します。
ko: 클립보드에 제목이 없습니다. 임시 제목으로 책을 만듭니다.
pt: Nenhum título encontrado na área de transferência. Criando livro com título provisório.
ru: Название не найдено в буфере обмена. Создаём книгу с временным названием.
zh: 剪贴板中未找到标题。使用占位符标题创建图书。
zh_tw: 剪貼簿中未找到標題。使用佔位符標題建立圖書。

# bookCreatedWithTitle
source: Book created with AI-generated title: "{title}"
ar: تم إنشاء كتاب بعنوان من الذكاء الاصطناعي: "{title}"
de: Buch mit KI-generiertem Titel erstellt: "{title}"
es: Libro creado con título generado por IA: "{title}"
fr: Livre créé avec un titre généré par IA : "{title}"
hi: AI-जनित शीर्षक के साथ पुस्तक बनाई गई: "{title}"
ja: AI生成タイトルで本を作成しました："{title}"
ko: AI 생성 제목으로 책을 만들었습니다: "{title}"
pt: Livro criado com título gerado por IA: "{title}"
ru: Книга создана с названием, сгенерированным ИИ: "{title}"
zh: 已创建带有 AI 生成标题的图书："{title}"
zh_tw: 已建立帶有 AI 生成標題的圖書："{title}"

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
zh: 设置
zh_tw: 設定

source: Reading
ar: جارٍ القراءة
de: Lesen
es: Leyendo
fr: En Lecture
hi: पढ़ रहे हैं
ja: 読書中
ko: 읽는 중
pt: Lendo
ru: Читаю
zh: 阅读中
zh_tw: 閱讀中

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
hi: पूर्ण
ja: 完了
ko: 완료
pt: Concluído
ru: Завершено
zh: 已完成
zh_tw: 已完成

source: Draft
ar: مسودة
de: Entwurf
es: Borrador
fr: Brouillon
hi: ड्राफ़्ट
ja: 下書き
ko: 초안
pt: Rascunho
ru: Черновик
zh: 草稿
zh_tw: 草稿

# errorLoadingBooks
source: Error loading books: {error}
ar: خطأ في تحميل الكتب: {error}
de: Fehler beim Laden der Bücher: {error}
es: Error al cargar libros: {error}
fr: Erreur lors du chargement des livres : {error}
hi: पुस्तकें लोड करने में त्रुटि: {error}
ja: 本の読み込みエラー：{error}
ko: 책을 불러오는 중 오류 발생: {error}
pt: Erro ao carregar livros: {error}
ru: Ошибка загрузки книг: {error}
zh: 加载图书时出错：{error}
zh_tw: 載入圖書時發生錯誤：{error}

source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
ja: 再試行
ko: 다시 시도
pt: Tentar Novamente
ru: Повторить
zh: 重试
zh_tw: 重試

source: Untitled Book
ar: كتاب بدون عنوان
de: Buch Ohne Titel
es: Libro Sin Título
fr: Livre Sans Titre
hi: शीर्षक रहित पुस्तक
ja: 無題の本
ko: 제목 없는 책
pt: Livro Sem Título
ru: Книга Без Названия
zh: 无标题图书
zh_tw: 無標題圖書

# settingsTitle
source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
hi: सेटिंग्स
ja: 設定
ko: 설정
pt: Configurações
ru: Параметры
zh: 设置
zh_tw: 設定

# writingPreferencesSection
source: Writing Preferences
ar: تفضيلات الكتابة
de: Schreibpräferenzen
es: Preferencias de Escritura
fr: Préférences d'Écriture
hi: लेखन प्राथमिकताएं
ja: 執筆の好み
ko: 글쓰기 선호도
pt: Preferências de Escrita
ru: Предпочтения письма
zh: 写作偏好
zh_tw: 寫作偏好

# contentGenerationSection
source: Content Generation
ar: توليد المحتوى
de: Inhaltsgenerierung
es: Generación de Contenido
fr: Génération de Contenu
hi: सामग्री निर्माण
ja: コンテンツ生成
ko: 콘텐츠 생성
pt: Geração de Conteúdo
ru: Генерация контента
zh: 内容生成
zh_tw: 內容生成

# aboutSection
source: About
ar: حول
de: Über
es: Acerca de
fr: À propos
hi: बारे में
ja: について
ko: 정보
pt: Sobre
ru: О программе
zh: 关于
zh_tw: 關於

# writingStyleLabel
source: Writing Style
ar: نمط الكتابة
de: Schreibstil
es: Estilo de Escritura
fr: Style d'Écriture
hi: लेखन शैली
ja: 執筆スタイル
ko: 글쓰기 스타일
pt: Estilo de Escrita
ru: Стиль письма
zh: 写作风格
zh_tw: 寫作風格

# writingStyleCreative
source: Creative - Imaginative and expressive
ar: إبداعي - خيالي وتعبيري
de: Kreativ - Fantasievoll und ausdrucksstark
es: Creativo - Imaginativo y expresivo
fr: Créatif - Imaginatif et expressif
hi: रचनात्मक - कल्पनाशील और अभिव्यक्तिपूर्ण
ja: 創造的 - 想像力豊かで表現力豊か
ko: 창의적 - 상상력 있고 표현력 있는
pt: Criativo - Imaginativo e expressivo
ru: Творческий - Воображаемый и выразительный
zh: 创意 - 富有想象力和表现力
zh_tw: 創意 - 富有想像力和表現力

# writingStyleBalanced
source: Balanced - Moderate creativity
ar: متوازن - إبداع معتدل
de: Ausgewogen - Moderate Kreativität
es: Equilibrado - Creatividad moderada
fr: Équilibré - Créativité modérée
hi: संतुलित - मध्यम रचनात्मकता
ja: バランス - 中程度の創造性
ko: 균형 - 중간 정도의 창의성
pt: Equilibrado - Criatividade moderada
ru: Сбалансированный - Умеренная творчество
zh: 平衡 - 中等创意
zh_tw: 平衡 - 中等創意

# writingStylePrecise
source: Precise - Clear and concise
ar: دقيق - واضح وموجز
de: Präzise - Klar und prägnant
es: Preciso - Claro y conciso
fr: Précis - Clair et concis
hi: सटीक - स्पष्ट और संक्षिप्त
ja: 正確 - 明確で簡潔
ko: 정확 - 명확하고 간결
pt: Preciso - Claro e conciso
ru: Точный - Четкий и лаконичный
zh: 精确 - 清晰简洁
zh_tw: 精確 - 清晰簡潔

# contentLanguageLabel
source: Content Language
ar: لغة المحتوى
de: Inhaltssprache
es: Idioma del Contenido
fr: Langue du Contenu
hi: सामग्री भाषा
ja: コンテンツ言語
ko: 콘텐츠 언어
pt: Idioma do Conteúdo
ru: Язык контента
zh: 内容语言
zh_tw: 內容語言

# uiLanguageLabel
source: UI Language
ar: لغة الواجهة
de: Schnittstellensprache
es: Idioma de la Interfaz
fr: Langue de l'Interface
hi: यूआई भाषा
ja: UI言語
ko: UI 언어
pt: Idioma da Interface
ru: Язык интерфейса
zh: 界面语言
zh_tw: 介面語言

# uiLanguageSystemDefault
source: System Default
ar: افتراضي النظام
de: Systemstandard
es: Sistema Predeterminado
fr: Par Défaut du Système
hi: सिस्टम डिफ़ॉल्ट
ja: システムデフォルト
ko: 시스템 기본값
pt: Padrão do Sistema
ru: По умолчанию системы
zh: 系统默认
zh_tw: 系統預設

# toneLabel
source: Tone
ar: النبرة
de: Ton
es: Tono
fr: Ton
hi: स्वर
ja: トーン
ko: 톤
pt: Tom
ru: Тон
zh: 语气
zh_tw: 語氣

# toneCasual
source: Casual - Friendly and relaxed
ar: عرضي - ودود وممتع
de: Lässig - Freundlich und entspannt
es: Casual - Amigable y relajado
fr: Décontracté - Amical et relaxé
hi: आकस्मिक - मैत्रीपूर्ण और आरामदायक
ja: カジュアル - フレンドリーでリラックス
ko: 캐주얼 - 친근하고 편한
pt: Casual - Amigável e descontraído
ru: Непринужденный - Дружелюбный и расслабленный
zh: 休闲 - 友好轻松
zh_tw: 休閒 - 友善輕鬆

# toneNeutral
source: Neutral - Balanced tone
ar: محايد - نبرة متوازنة
de: Neutral - Ausgewogener Ton
es: Neutral - Tono equilibrado
fr: Neutre - Ton équilibré
hi: तटस्थ - संतुलित स्वर
ja: ニュートラル - バランスの取れたトーン
ko: 중립 - 균형 잡힌 톤
pt: Neutro - Tom equilibrado
ru: Нейтральный - Сбалансированный тон
zh: 中立 - 平衡语气
zh_tw: 中立 - 平衡語氣

# toneFormal
source: Formal - Professional and serious
ar: رسمي - احترافي وجاد
de: Formal - Professionell und ernst
es: Formal - Profesional y serio
fr: Formel - Professionnel et sérieux
hi: औपचारिक - व्यावसायिक और गंभीर
ja: フォーマル - プロフェッショナルで真摯
ko: 공식 - 전문적이고 진지
pt: Formal - Profissional e sério
ru: Официальный - Профессиональный и серьезный
zh: 正式 - 专业严肃
zh_tw: 正式 - 專業嚴肅

# vocabularyLevelLabel
source: Vocabulary Level
ar: مستوى المفردات
de: Wortschatzstufe
es: Nivel de Vocabulario
fr: Niveau de Vocabulaire
hi: शब्दावली स्तर
ja: 語彙レベル
ko: 어휘 수준
pt: Nível de Vocabulário
ru: Уровень словарного запаса
zh: 词汇级别
zh_tw: 詞彙級別

# vocabularySimple
source: Simple - Easy to understand
ar: بسيط - سهل الفهم
de: Einfach - Leicht verständlich
es: Simple - Fácil de entender
fr: Simple - Facile à comprendre
hi: सरल - समझने में आसान
ja: シンプル - 理解しやすい
ko: 간단 - 이해하기 쉬운
pt: Simples - Fácil de entender
ru: Простой - Легко понять
zh: 简单 - 易于理解
zh_tw: 簡單 - 易於理解

# vocabularyModerate
source: Moderate - Balanced vocabulary
ar: معتدل - مفردات متوازنة
de: Moderat - Ausgewogener Wortschatz
es: Moderado - Vocabulario equilibrado
fr: Modéré - Vocabulaire équilibré
hi: मध्यम - संतुलित शब्दावली
ja: 中程度 - バランスの取れた語彙
ko: 중간 - 균형 잡힌 어휘
pt: Moderado - Vocabulário equilibrado
ru: Умеренный - Сбалансированный словарь
zh: 中等 - 平衡词汇
zh_tw: 中等 - 平衡詞彙

# vocabularyAdvanced
source: Advanced - Rich vocabulary
ar: متقدم - مفردات غنية
de: Fortgeschritten - Reicher Wortschatz
es: Avanzado - Vocabulario rico
fr: Avancé - Vocabulaire riche
hi: उन्नत - समृद्ध शब्दावली
ja: 上級 - 豊かな語彙
ko: 고급 - 풍부한 어휘
pt: Avançado - Vocabulário rico
ru: Продвинутый - Богатый словарь
zh: 高级 - 丰富词汇
zh_tw: 高級 - 豐富詞彙

# favoriteAuthorLabel
source: Favorite Author
ar: المؤلف المفضل
de: Lieblingsautor
es: Autor Favorito
fr: Auteur Préféré
hi: पसंदीदा लेखक
ja: 好きな著者
ko: 선호하는 작가
pt: Autor Favorito
ru: Любимый автор
zh: 喜爱的作者
zh_tw: 喜愛的作者

# favoriteAuthorHint
source: e.g., J.K. Rowling
ar: على سبيل المثال: J.K. Rowling
de: z. B. J.K. Rowling
es: p. ej., J.K. Rowling
fr: ex., J.K. Rowling
hi: उदा.: जे.के. राउलिंग
ja: 例：J.K. ローリング
ko: 예: J.K. 롤링
pt: ex., J.K. Rowling
ru: напр., Дж. К. Роулинг
zh: 例如：J.K. 罗琳
zh_tw: 例如：J.K. 羅琳

# favoriteAuthorDescription
source: Enter the name of your favorite author for AI to emulate their writing style (optional).
ar: أدخل اسم مؤلفك المفضل حتى تحاكي الذكاء الاصطناعي أسلوب كتابته (اختياري).
de: Geben Sie den Namen Ihres Lieblingsautors ein, damit die KI seinen Schreibstil nachahmt (optional).
es: Ingrese el nombre de su autor favorito para que la IA emule su estilo de escritura (opcional).
fr: Entrez le nom de votre auteur préféré pour que l'IA émule son style d'écriture (facultatif).
hi: अपने पसंदीदा लेखक का नाम दर्ज करें ताकि कृत्रिम बुद्धिमत्ता उनकी लेखन शैली की नकल कर सके (वैकल्पिक)।
ja: 好きな著者の名前を入力すると、AIがその執筆スタイルを模倣します（オプション）。
ko: AI가 자신의 글쓰기 스타일을 모방하도록 선호하는 작가의 이름을 입력하세요 (선택 사항).
pt: Digite o nome do seu autor favorito para que a IA emule seu estilo de escrita (opcional).
ru: Введите имя вашего любимого автора, чтобы ИИ подражал их стилю письма (опционально).
zh: 输入您喜爱的作者名称，AI 将模仿他们的写作风格（可选）。
zh_tw: 輸入您喜愛的作者名稱，AI 將模仿他們的寫作風格（可選）。

# defaultChapterCountLabel
source: Default Chapter Count
ar: عدد الفصول الافتراضي
de: Standardkapitelanzahl
es: Número Predeterminado de Capítulos
fr: Nombre Predéfini de Chapitres
hi: डिफ़ॉल्ट अध्याय संख्या
ja: デフォルト章数
ko: 기본 장 수
pt: Contagem de Capítulos Padrão
ru: Количество глав по умолчанию
zh: 默认章节数
zh_tw: 預設章節數

# chapterCountOption
source: {count} chapters
ar: {count} فصول
de: {count} Kapitel
es: {count} capítulos
fr: {count} chapitres
hi: {count} अध्याय
ja: {count}章
ko: {count}장
pt: {count} capítulos
ru: {count} глав
zh: {count} 个章节
zh_tw: {count} 個章節

source: Short book
ar: كتاب قصير
de: Kurzes Buch
es: Libro corto
fr: Livre court
hi: छोटी किताब
ja: 短編
ko: 짧은 책
pt: Livro curto
ru: Короткая книга
zh: 短书
zh_tw: 短書

source: Standard book
ar: كتاب قياسي
de: Standardbuch
es: Libro estándar
fr: Livre standard
hi: मानक किताब
ja: 標準的な本
ko: 표준 책
pt: Livro padrão
ru: Стандартная книга
zh: 标准书籍
zh_tw: 標準書籍

source: Longer book
ar: كتاب أطول
de: Längeres Buch
es: Libro más largo
fr: Livre plus long
hi: लंबी किताब
ja: より長い本
ko: 더 긴 책
pt: Livro mais longo
ru: Более длинная книга
zh: 较长书籍
zh_tw: 較長書籍

source: Full-length novel
ar: رواية طويلة
de: Vollständiger Roman
es: Novela de larga duración
fr: Roman complet
hi: पूर्ण लंबाई उपन्यास
ja: フル長編小説
ko: 완전한 장편 소설
pt: Romance completo
ru: Полнометражный роман
zh: 完整长篇小说
zh_tw: 完整長篇小說

source: Extended novel
ar: رواية موسعة
de: Erweiterter Roman
es: Novela extendida
fr: Roman étendu
hi: विस्तारित उपन्यास
ja: 拡張長編小説
ko: 확장 장편 소설
pt: Romance estendido
ru: Расширенный роман
zh: 拓展长篇小说
zh_tw: 拓展長篇小說

source: Epic length
ar: طول ملحمي
de: Epische Länge
es: Longitud épica
fr: Longueur épique
hi: महाकाव्य लंबाई
ja: 叙事詩の長さ
ko: 서사시적 길이
pt: Comprimento épico
ru: Эпическая длина
zh: 史诗级长度
zh_tw: 史詩級長度

# versionLabel
source: Version
ar: الإصدار
es: Versión
hi: संस्करण
ja: バージョン
ko: 버전
pt: Versão
ru: Версия
zh: 版本
zh_tw: 版本

# licenseLabel
source: License
ar: الترخيص
de: Lizenz
es: Licencia
fr: Licence
hi: लाइसेंस
ja: ライセンス
ko: 라이선스
pt: Licença
ru: Лицензия
zh: 许可证
zh_tw: 授權條款

source: MIT License
ar: ترخيص MIT
de: MIT-Lizenz
es: Licencia MIT
fr: Licence MIT
hi: MIT लाइसेंस
ja: MITライセンス
ko: MIT 라이선스
pt: Licença MIT
ru: Лицензия MIT
zh: MIT 许可证
zh_tw: MIT 授權條款

# clearAuthor
source: Clear
ar: مسح
de: Löschen
es: Limpiar
fr: Effacer
hi: साफ करें
ja: クリア
ko: 지우기
pt: Limpar
ru: Очистить
zh: 清除
zh_tw: 清除

# saveAuthor
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
hi: सहेजें
ja: 保存
ko: 저장
pt: Salvar
ru: Сохранить
zh: 保存
zh_tw: 保存
